0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/graphics/nemagfx_performance_test/iar/startup_iar.c
//*****************************************************************************
//
//! @file startup_iar.c
//!
//! @brief Definitions for interrupt handlers, the vector table, and the stack.
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5p0p1-61912905f0 of the AmbiqSuite Development Package.
//
//*****************************************************************************

//#include <stdint.h>
#include "apollo510.h"

//*****************************************************************************
//
// Enable the IAR extensions for this source file.
//
//*****************************************************************************
#pragma language = extended

//*****************************************************************************
//
// Weak function links.
//
//*****************************************************************************
#pragma weak MemManage_Handler      = HardFault_Handler
#pragma weak BusFault_Handler       = HardFault_Handler
#pragma weak UsageFault_Handler     = HardFault_Handler
#pragma weak SecureFault_Handler    = HardFault_Handler
#pragma weak SVC_Handler            = am_default_isr
#pragma weak DebugMon_Handler       = am_default_isr
#pragma weak PendSV_Handler         = am_default_isr
#pragma weak SysTick_Handler        = am_default_isr

#pragma weak am_brownout_isr        = am_default_isr
#pragma weak am_watchdog_isr        = am_default_isr
#pragma weak am_rtc_isr             = am_default_isr
#pragma weak am_vcomp_isr           = am_default_isr
#pragma weak am_ioslave_ios_isr     = am_default_isr
#pragma weak am_ioslave_acc_isr     = am_default_isr
#pragma weak am_iomaster0_isr       = am_default_isr
#pragma weak am_iomaster1_isr       = am_default_isr
#pragma weak am_iomaster2_isr       = am_default_isr
#pragma weak am_iomaster3_isr       = am_default_isr
#pragma weak am_iomaster4_isr       = am_default_isr
#pragma weak am_iomaster5_isr       = am_default_isr
#pragma weak am_iomaster6_isr       = am_default_isr
#pragma weak am_iomaster7_isr       = am_default_isr
#pragma weak am_uart_isr            = am_default_isr
#pragma weak am_uart1_isr           = am_default_isr
#pragma weak am_uart2_isr           = am_default_isr
#pragma weak am_uart3_isr           = am_default_isr
#pragma weak am_adc_isr             = am_default_isr
#pragma weak am_mspi0_isr           = am_default_isr
#pragma weak am_mspi1_isr           = am_default_isr
#pragma weak am_mspi2_isr           = am_default_isr
#pragma weak am_clkgen_isr          = am_default_isr
#pragma weak am_cryptosec_isr       = am_default_isr
#pragma weak am_sdio0_isr           = am_default_isr
#pragma weak am_usb_isr             = am_default_isr
#pragma weak am_gpu_isr             = am_default_isr
#pragma weak am_disp_isr            = am_default_isr
#pragma weak am_dsi_isr             = am_default_isr
#pragma weak am_stimer_cmpr0_isr    = am_default_isr
#pragma weak am_stimer_cmpr1_isr    = am_default_isr
#pragma weak am_stimer_cmpr2_isr    = am_default_isr
#pragma weak am_stimer_cmpr3_isr    = am_default_isr
#pragma weak am_stimer_cmpr4_isr    = am_default_isr
#pragma weak am_stimer_cmpr5_isr    = am_default_isr
#pragma weak am_stimer_cmpr6_isr    = am_default_isr
#pragma weak am_stimer_cmpr7_isr    = am_default_isr
#pragma weak am_stimerof_isr        = am_default_isr
#pragma weak am_audadc0_isr         = am_default_isr
#pragma weak am_dspi2s0_isr         = am_default_isr
#pragma weak am_dspi2s1_isr         = am_default_isr
#pragma weak am_pdm0_isr            = am_default_isr
#pragma weak am_mspi3_isr           = am_default_isr
#pragma weak am_gpio0_001f_isr      = am_default_isr
#pragma weak am_gpio0_203f_isr      = am_default_isr
#pragma weak am_gpio0_405f_isr      = am_default_isr
#pragma weak am_gpio0_607f_isr      = am_default_isr
#pragma weak am_gpio0_809f_isr      = am_default_isr
#pragma weak am_gpio0_a0bf_isr      = am_default_isr
#pragma weak am_gpio0_c0df_isr      = am_default_isr
#pragma weak am_gpio0_e0ff_isr      = am_default_isr
#pragma weak am_timer00_isr         = am_default_isr
#pragma weak am_timer01_isr         = am_default_isr
#pragma weak am_timer02_isr         = am_default_isr
#pragma weak am_timer03_isr         = am_default_isr
#pragma weak am_timer04_isr         = am_default_isr
#pragma weak am_timer05_isr         = am_default_isr
#pragma weak am_timer06_isr         = am_default_isr
#pragma weak am_timer07_isr         = am_default_isr
#pragma weak am_timer08_isr         = am_default_isr
#pragma weak am_timer09_isr         = am_default_isr
#pragma weak am_timer10_isr         = am_default_isr
#pragma weak am_timer11_isr         = am_default_isr
#pragma weak am_timer12_isr         = am_default_isr
#pragma weak am_timer13_isr         = am_default_isr
#pragma weak am_timer14_isr         = am_default_isr
#pragma weak am_timer15_isr         = am_default_isr
#pragma weak am_sdio1_isr           = am_default_isr
#pragma weak am_software0_isr       = am_default_isr
#pragma weak am_software1_isr       = am_default_isr
#pragma weak am_software2_isr       = am_default_isr
#pragma weak am_software3_isr       = am_default_isr
#pragma weak am_gpio1_001f_isr      = am_default_isr
#pragma weak am_gpio1_203f_isr      = am_default_isr
#pragma weak am_gpio1_405f_isr      = am_default_isr
#pragma weak am_gpio1_607f_isr      = am_default_isr
#pragma weak am_gpio1_809f_isr      = am_default_isr
#pragma weak am_gpio1_a0bf_isr      = am_default_isr
#pragma weak am_gpio1_c0df_isr      = am_default_isr
#pragma weak am_ioslave_fd0_isr     = am_default_isr
#pragma weak am_ioslave_fd0_acc_isr = am_default_isr
#pragma weak am_ioslave_fd1_isr     = am_default_isr
#pragma weak am_ioslave_fd1_acc_isr = am_default_isr
#pragma weak FloatingPoint_Handler  = am_default_isr
#pragma weak am_otp_isr             = am_default_isr


//*****************************************************************************
//
// Forward declaration of the default fault handlers.
//
//*****************************************************************************
extern __stackless void Reset_Handler(void);
extern __weak void NMI_Handler(void);
extern __weak void HardFault_Handler(void);
extern        void MemManage_Handler(void);
extern        void BusFault_Handler(void);
extern        void UsageFault_Handler(void);
extern        void SecureFault_Handler(void);
extern        void SVC_Handler(void);
extern        void DebugMon_Handler(void);
extern        void PendSV_Handler(void);
extern        void SysTick_Handler(void);
extern void am_brownout_isr(void);          // 0
extern void am_watchdog_isr(void);          // 1
extern void am_rtc_isr(void);               // 2
extern void am_vcomp_isr(void);             // 3
extern void am_ioslave_ios_isr(void);       // 4
extern void am_ioslave_acc_isr(void);       // 5
extern void am_iomaster0_isr(void);         // 6
extern void am_iomaster1_isr(void);         // 7
extern void am_iomaster2_isr(void);         // 8
extern void am_iomaster3_isr(void);         // 9
extern void am_iomaster4_isr(void);         // 10
extern void am_iomaster5_isr(void);         // 11
extern void am_iomaster6_isr(void);         // 12
extern void am_iomaster7_isr(void);         // 13
extern void am_uart_isr(void);              // 15
extern void am_uart1_isr(void);             // 16
extern void am_uart2_isr(void);             // 17
extern void am_uart3_isr(void);             // 18
extern void am_adc_isr(void);               // 19
extern void am_mspi0_isr(void);             // 20
extern void am_mspi1_isr(void);             // 21
extern void am_mspi2_isr(void);             // 22
extern void am_clkgen_isr(void);            // 23
extern void am_cryptosec_isr(void);         // 24
extern void am_sdio0_isr(void);             // 26
extern void am_usb_isr(void);               // 27
extern void am_gpu_isr(void);               // 28
extern void am_disp_isr(void);              // 29
extern void am_dsi_isr(void);               // 30
extern void am_stimer_cmpr0_isr(void);      // 32
extern void am_stimer_cmpr1_isr(void);      // 33
extern void am_stimer_cmpr2_isr(void);      // 34
extern void am_stimer_cmpr3_isr(void);      // 35
extern void am_stimer_cmpr4_isr(void);      // 36
extern void am_stimer_cmpr5_isr(void);      // 37
extern void am_stimer_cmpr6_isr(void);      // 38
extern void am_stimer_cmpr7_isr(void);      // 39
extern void am_stimerof_isr(void);          // 40
extern void am_audadc0_isr(void);           // 42
extern void am_dspi2s0_isr(void);           // 44
extern void am_dspi2s1_isr(void);           // 45
extern void am_pdm0_isr(void);              // 48
extern void am_mspi3_isr(void);             // 54
extern void am_gpio0_001f_isr(void);        // 56
extern void am_gpio0_203f_isr(void);        // 57
extern void am_gpio0_405f_isr(void);        // 58
extern void am_gpio0_607f_isr(void);        // 59
extern void am_gpio0_809f_isr(void);        // 60
extern void am_gpio0_a0bf_isr(void);        // 61
extern void am_gpio0_c0df_isr(void);        // 62
extern void am_gpio0_e0ff_isr(void);        // 63
extern void am_timer00_isr(void);           // 67
extern void am_timer01_isr(void);           // 68
extern void am_timer02_isr(void);           // 69
extern void am_timer03_isr(void);           // 70
extern void am_timer04_isr(void);           // 71
extern void am_timer05_isr(void);           // 72
extern void am_timer06_isr(void);           // 73
extern void am_timer07_isr(void);           // 74
extern void am_timer08_isr(void);           // 75
extern void am_timer09_isr(void);           // 76
extern void am_timer10_isr(void);           // 77
extern void am_timer11_isr(void);           // 78
extern void am_timer12_isr(void);           // 79
extern void am_timer13_isr(void);           // 80
extern void am_timer14_isr(void);           // 81
extern void am_timer15_isr(void);           // 82
extern void am_sdio1_isr(void);             // 84
extern void am_software0_isr(void);         // 92
extern void am_software1_isr(void);         // 93
extern void am_software2_isr(void);         // 94
extern void am_software3_isr(void);         // 95
extern void am_ioslave_fd0_isr(void);       // 96
extern void am_ioslave_fd0_acc_isr(void);   // 97
extern void am_ioslave_fd1_isr(void);       // 98
extern void am_ioslave_fd1_acc_isr(void);   // 99
extern void am_gpio1_001f_isr(void);        // 125
extern void am_gpio1_203f_isr(void);        // 126
extern void am_gpio1_405f_isr(void);        // 127
extern void am_gpio1_607f_isr(void);        // 128
extern void am_gpio1_809f_isr(void);        // 129
extern void am_gpio1_a0bf_isr(void);        // 130
extern void am_gpio1_c0df_isr(void);        // 131
extern void FloatingPoint_Handler(void);    // 133
extern void am_otp_isr(void);               // 134

extern void am_default_isr(void);

//*****************************************************************************
//
// The entry point for the application startup code.
//
//*****************************************************************************
extern void __iar_program_start(void);

//*****************************************************************************
//
// Reserve space for the system stack.
//
//*****************************************************************************
static uint32_t pui32Stack[0xac0] @ ".stack";

//*****************************************************************************
//
// A union that describes the entries of the vector table.  The union is needed
// since the first entry is the stack pointer and the remainder are function
// pointers.
//
//*****************************************************************************
typedef union
{
    void (*pfnHandler)(void);
    uint32_t ui32Ptr;
}
uVectorEntry;

//*****************************************************************************
//
// The vector table.
//
// Proper alignment of the vector table is dependent on the number of
// external (peripheral) interrupts, see the following table for proper
// vectorbaseaddress alignment.
//     0-16      32-word
//    17-48      64-word
//    49-112    128-word  (Apollo510)
//   113-240    256-word
//
// The Apollo510 vector table must be located on a 512 byte boundary.
//
// Note: Aliasing and weakly exporting am_mpufault_isr, am_busfault_isr, and
// am_usagefault_isr does not work if am_fault_isr is defined externally.
// Therefore, we'll explicitly use am_fault_isr in the table for those vectors.
//
//*****************************************************************************
__root const uVectorEntry __vector_table[] @ ".intvec" =
{
    { .ui32Ptr = (uint32_t)pui32Stack + sizeof(pui32Stack) },
                                            // The initial stack pointer
    Reset_Handler,                          // The reset handler
    NMI_Handler,                            // The NMI handler
    HardFault_Handler,                      // The hard fault handler
    MemManage_Handler,                      // The MemManage_Handler
    BusFault_Handler,                       // The BusFault_Handler
    UsageFault_Handler,                     // The UsageFault_Handler
    SecureFault_Handler,                    // The Secure Fault Handler
    0,                                      // Reserved
    0,                                      // Reserved
    0,                                      // Reserved
    SVC_Handler,                            // SVCall handler
    DebugMon_Handler,                       // Debug monitor handler
    0,                                      // Reserved
    PendSV_Handler,                         // The PendSV handler
    SysTick_Handler,                        // The SysTick handler

