0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/graphics/nemagfx_performance_test/iar/startup_iar.c
//******************************************************************************
//
// Place code immediately following vector table.
//
//******************************************************************************
//******************************************************************************
//
// The Patch table.
//
// The patch table should pad the vector table size to a total of 128 entries
// such that the code begins at 0x200.
// In other words, the final peripheral IRQ is always IRQ 111 (0-based).
//
//******************************************************************************
__root const uint32_t __Patchable[] @ ".patch" =
{
                   0, 0, 0, 0, 0,           // 135-139
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 140-149
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 150-159
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 160-169
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 170-179
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 180-189
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 190-199
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 200-209
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 210-219
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 220-229
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0            // 230-239
};

// define the start of the patch table - at what would be vector 135
const uint32_t  * const __pPatchable =  (uint32_t *) __Patchable;

//*****************************************************************************
//
// Note - The template for this function is originally found in IAR's module,
//        low_level_init.c. As supplied by IAR, it is an empty function.
//
// This module contains the function `__low_level_init', a function
// that is called before the `main' function of the program.  Normally
// low-level initializations - such as setting the prefered interrupt
// level or setting the watchdog - can be performed here.
//
// Note that this function is called before the data segments are
// initialized, this means that this function cannot rely on the
// values of global or static variables.
//
// When this function returns zero, the startup code will inhibit the
// initialization of the data segments. The result is faster startup,
// the drawback is that neither global nor static data will be
// initialized.
//
// Copyright 1999-2017 IAR Systems AB.
//
// $Revision: 112610 $
//
//
//
//
//*****************************************************************************
#define AM_REGVAL(x)               (*((volatile uint32_t *)(x)))
#define VTOR_ADDR                   0xE000ED08

__interwork int __low_level_init(void)
{

    AM_REGVAL(VTOR_ADDR) = (uint32_t)&__vector_table;

    /*==================================*/
    /* Choose if segment initialization */
    /* should be done or not.           */
    /* Return: 0 to omit seg_init       */
    /*         1 to run seg_init        */
    /*==================================*/
    return 1;
}

//*****************************************************************************
//
// This is the code that gets called when the processor first starts execution
// following a reset event.  Only the absolutely necessary set is performed,
// after which the application supplied entry() routine is called.
//
//*****************************************************************************
void
Reset_Handler(void)
{
    //
    // Set the stack limits
    // Note: Stack limits are not set by __iar_program_start().
    //
    __set_MSPLIM((uint32_t)&pui32Stack);
    __set_PSPLIM((uint32_t)&pui32Stack);

//
// Set the SSRAM non-cacheable for application explicitly requested SSRAM_NON_CACHEABLE
//
#ifdef SSRAM_NON_CACHEABLE
    __DSB();
    //
    // Set up non-cachable MPU region attributes.
    //
    ARM_MPU_SetMemAttr (
        7, // use the last MPU attribute slot
        ARM_MPU_ATTR (
        ARM_MPU_ATTR_MEMORY_ (0, 1, 0, 0),
        ARM_MPU_ATTR_MEMORY_ (0, 1, 0, 0)
        )
    );

    //
    // Set the whole SSRAM non-cacheable
    //
    static ARM_MPU_Region_t region;
    region.RBAR = ((0x20080000 & MPU_RBAR_BASE_Msk) |
                    (ARM_MPU_SH_NON << MPU_RBAR_SH_Pos) |
                    (ARM_MPU_AP_(0, 1) << MPU_RBAR_AP_Pos) |
                    (1 << MPU_RBAR_XN_Pos));
    region.RLAR = ((0x2037FFFF & MPU_RLAR_LIMIT_Msk) |
                    (7 << MPU_RLAR_AttrIndx_Pos) |
                    (1));
    ARM_MPU_Load (
        15, // use the last MPU region
        (ARM_MPU_Region_t const*)&region, 1);

    //
    // Enable MPU
    //
#pragma diag_suppress = Go004
    SCB_CleanInvalidateDCache();
#pragma diag_default = Go004
    ARM_MPU_Enable((1 << MPU_CTRL_HFNMIENA_Pos) |
                    (1 << MPU_CTRL_PRIVDEFENA_Pos));

#endif // SSRAM_NON_CACHEABLE

    //
    // Call the application's entry point.
    //
    __iar_program_start();

    //SystemInit();
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a NMI.  This
// simply enters an infinite loop, preserving the system state for examination
// by a debugger.
//
//*****************************************************************************
__weak void
NMI_Handler(void)
{
    //
    // Enter into an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
__weak void
HardFault_Handler(void)
{
    //
    // Enter into an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
void
am_default_isr(void)
{
    //
    // Enter into an infinite loop.
    //
    while(1)
    {
    }
}

